app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["email", "pcarrick@cusonet.com"]]
---
  def create
    @user = User.find_for_database_authentication(email: params[:user][:email])